assets/modify_personal_info.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
	<soap12:Body>
		<modifyPersonalInfo xmlns="http://rentcar.bbcwx.com/">
			<userName>$userName</userName>
			<password>$password</password>
			<name>$name</name>
			<userRank>$userRank</userRank>
			<idType>$idType</idType>
			<id>$id</id>
			<phoneNumber>$phoneNumber</phoneNumber>
			<emailAddress>$emailAddress</emailAddress>
		</modifyPersonalInfo>
	</soap12:Body>
</soap12:Envelope>